Autodesk.Revit.DB.IFC.ExporterIFC.RegisterShapeForPresentationLayer(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.IFC.IFCAnyHandle)
Sets an IfcShapeRepresentation to be used for the IfcPresentationLayerAssignment associated with
the given Revit category and element.
pElement:
The element.
categoryId:
The category id.
newShapeRepresentation:
The IfcShapeRepresentation handle.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012